<?xml version="1.0"?>
<net name="tf2onnx" version="11">
	<layers>
		<layer id="3" name="input-0-image" type="Parameter" version="opset1">
			<data shape="?,284,96,5" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input-0-image">
					<dim>-1</dim>
					<dim>284</dim>
					<dim>96</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input-1-itemprops" type="Parameter" version="opset1">
			<data shape="?,180" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="input-1-itemprops">
					<dim>-1</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input-2-metas" type="Parameter" version="opset1">
			<data shape="?,280" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="input-2-metas">
					<dim>-1</dim>
					<dim>280</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="input-3-attributes" type="Parameter" version="opset1">
			<data shape="?,300" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="input-3-attributes">
					<dim>-1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_65" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/model_4/conv2d_12/BiasAdd__6" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>284</dim>
					<dim>96</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/conv2d_12/BiasAdd__6:0">
					<dim>-1</dim>
					<dim>5</dim>
					<dim>284</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/model_4/conv2d_12/BiasAdd_weights_fused_bn" type="Const" version="opset1">
			<data element_type="f32" shape="16, 5, 7, 7" offset="32" size="15680" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_4/conv2d_12/BiasAdd_weights_fused_bn">
					<dim>16</dim>
					<dim>5</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/model_4/conv2d_12/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>5</dim>
					<dim>284</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>5</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>278</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_87" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="15712" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/model_4/conv2d_12/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>278</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_48/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>278</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/model_4/activation_48/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>278</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/activation_48/Relu:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>278</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/model_4/max_pooling2d_12/MaxPool" type="MaxPool" version="opset8">
			<data strides="5, 5" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="5, 5" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>278</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/max_pooling2d_12/MaxPool:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>18</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model_4/conv2d_13/BiasAdd_weights_fused_bn" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 5, 5" offset="15776" size="51200" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_4/conv2d_13/BiasAdd_weights_fused_bn">
					<dim>32</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/model_4/conv2d_13/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>51</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_137" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="66976" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/model_4/conv2d_13/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>51</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_49/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>51</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model_4/activation_49/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>51</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/activation_49/Relu:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>51</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model_4/max_pooling2d_13/MaxPool" type="MaxPool" version="opset8">
			<data strides="3, 3" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>51</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/max_pooling2d_13/MaxPool:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/model_4/conv2d_14/BiasAdd_weights_fused_bn" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="67104" size="73728" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_4/conv2d_14/BiasAdd_weights_fused_bn">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/model_4/conv2d_14/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>17</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Reshape_187" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="140832" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/model_4/conv2d_14/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_50/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/model_4/activation_50/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/activation_50/Relu:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/model_4/max_pooling2d_14/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/max_pooling2d_14/MaxPool:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_217" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="141088" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/model_4/max_pooling2d_14/MaxPool__40" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>7</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/max_pooling2d_14/MaxPool__40:0">
					<dim>-1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="const_fold_opt__197" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="141120" size="16" />
			<output>
				<port id="0" precision="I64" names="const_fold_opt__197">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/model_4/flatten_16/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/flatten_16/Reshape:0">
					<dim>-1</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_2560" type="Const" version="opset1">
			<data element_type="f32" shape="128, 448" offset="141136" size="229376" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Multiply_2508" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_2706" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="370512" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/model_4/batch_normalization_51/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_51/batchnorm/add_1:0">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/model_4/activation_51/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/activation_51/Relu:0">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Func/StatefulPartitionedCall/input/_12:0" type="Const" version="opset1">
			<data element_type="f32" shape="5000, 8" offset="371024" size="160000" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_12:0">
					<dim>5000</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_230" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="531024" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/model_4/embedding_itemprop/embedding_lookup" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>5000</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>180</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/model_4/embedding_itemprop/embedding_lookup:0">
					<dim>-1</dim>
					<dim>180</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="const_fold_opt__216" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="531032" size="8" />
			<output>
				<port id="0" precision="I64" names="const_fold_opt__216">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/model_4/conv1d_12/Conv1D/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>180</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/conv1d_12/Conv1D/ExpandDims:0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>180</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_233" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/model_4/conv1d_12/Conv1D__46" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>180</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/conv1d_12/Conv1D__46:0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/model_4/conv1d_12/Conv1D/ExpandDims_1:0" type="Const" version="opset1">
			<data element_type="f32" shape="16, 8, 1, 5" offset="531040" size="2560" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_4/conv1d_12/Conv1D/ExpandDims_1:0">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/model_4/conv1d_12/Conv1D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>180</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/conv1d_12/Conv1D:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="const_fold_opt__216__225" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="533600" size="8" />
			<output>
				<port id="0" precision="I64" names="const_fold_opt__216__225">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/model_4/conv1d_12/Conv1D/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/conv1d_12/Conv1D/Squeeze:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="const_fold_opt__224" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1" offset="533608" size="64" />
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__224">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/model_4/conv1d_12/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/conv1d_12/BiasAdd:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="const_fold_opt__220__229" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="533672" size="8" />
			<output>
				<port id="0" precision="I64" names="const_fold_opt__220__229">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/model_4/max_pooling1d_16/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/max_pooling1d_16/ExpandDims:0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="new_shape__230" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="533680" size="32" />
			<output>
				<port id="0" precision="I64" names="new_shape__230">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/model_4/max_pooling1d_16/MaxPool__54" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/max_pooling1d_16/MaxPool__54:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>176</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/model_4/max_pooling1d_16/MaxPool" type="MaxPool" version="opset8">
			<data strides="3, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 1" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>176</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/max_pooling1d_16/MaxPool:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>58</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>58</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="axes_const__75__137" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="533712" size="8" />
			<output>
				<port id="0" precision="I64" names="axes_const__75__137">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/model_4/max_pooling1d_16/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>58</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/max_pooling1d_16/Squeeze:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>58</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/model_4/batch_normalization_52/batchnorm/mul:0" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1" offset="533720" size="64" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_52/batchnorm/mul:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/model_4/batch_normalization_52/batchnorm/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>58</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_52/batchnorm/mul_1:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>58</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="const_fold_opt__213" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1" offset="533784" size="64" />
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__213">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/model_4/batch_normalization_52/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>58</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_52/batchnorm/add_1:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>58</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/model_4/activation_52/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>58</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/activation_52/Relu:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>58</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_251" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="533848" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Transpose__126" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>58</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Transpose__126:0">
					<dim>-1</dim>
					<dim>58</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="const_fold_opt__194" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="533872" size="16" />
			<output>
				<port id="0" precision="I64" names="const_fold_opt__194">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/model_4/flatten_17/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>58</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/flatten_17/Reshape:0">
					<dim>-1</dim>
					<dim>928</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_2579" type="Const" version="opset1">
			<data element_type="f32" shape="16, 928" offset="533888" size="59392" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>928</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Multiply_2515" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>928</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>928</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_2707" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16" offset="593280" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/model_4/batch_normalization_53/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_53/batchnorm/add_1:0">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/model_4/activation_53/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/activation_53/Relu:0">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Func/StatefulPartitionedCall/input/_11:0" type="Const" version="opset1">
			<data element_type="f32" shape="5000, 8" offset="593344" size="160000" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_11:0">
					<dim>5000</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_264" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="531024" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/model_4/embedding_metas/embedding_lookup" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>5000</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>280</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/model_4/embedding_metas/embedding_lookup:0">
					<dim>-1</dim>
					<dim>280</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/model_4/conv1d_13/Conv1D/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>280</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/conv1d_13/Conv1D/ExpandDims:0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>280</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_267" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/model_4/conv1d_13/Conv1D__63" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>280</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/conv1d_13/Conv1D__63:0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>280</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/model_4/conv1d_13/Conv1D/ExpandDims_1:0" type="Const" version="opset1">
			<data element_type="f32" shape="16, 8, 1, 5" offset="753344" size="2560" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_4/conv1d_13/Conv1D/ExpandDims_1:0">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/model_4/conv1d_13/Conv1D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/conv1d_13/Conv1D:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>276</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/model_4/conv1d_13/Conv1D/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>276</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/conv1d_13/Conv1D/Squeeze:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>276</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="const_fold_opt__215" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1" offset="755904" size="64" />
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__215">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/model_4/conv1d_13/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>276</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/conv1d_13/BiasAdd:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>276</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/model_4/max_pooling1d_17/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>276</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/max_pooling1d_17/ExpandDims:0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>276</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="new_shape__231" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="755968" size="32" />
			<output>
				<port id="0" precision="I64" names="new_shape__231">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/model_4/max_pooling1d_17/MaxPool__71" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>16</dim>
					<dim>276</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/max_pooling1d_17/MaxPool__71:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>276</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/model_4/max_pooling1d_17/MaxPool" type="MaxPool" version="opset8">
			<data strides="3, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 1" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>276</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/max_pooling1d_17/MaxPool:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>92</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>92</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="StatefulPartitionedCall/model_4/max_pooling1d_17/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>92</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/max_pooling1d_17/Squeeze:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/model_4/batch_normalization_54/batchnorm/mul:0" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1" offset="756000" size="64" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_54/batchnorm/mul:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/model_4/batch_normalization_54/batchnorm/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_54/batchnorm/mul_1:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="const_fold_opt__221" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1" offset="756064" size="64" />
			<output>
				<port id="0" precision="FP32" names="const_fold_opt__221">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/model_4/batch_normalization_54/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_54/batchnorm/add_1:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="StatefulPartitionedCall/model_4/activation_54/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/activation_54/Relu:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_285" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="533848" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Transpose__144" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Transpose__144:0">
					<dim>-1</dim>
					<dim>92</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="const_fold_opt__193" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="756128" size="16" />
			<output>
				<port id="0" precision="I64" names="const_fold_opt__193">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="StatefulPartitionedCall/model_4/flatten_18/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>92</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/flatten_18/Reshape:0">
					<dim>-1</dim>
					<dim>1472</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_2598" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1472" offset="756144" size="94208" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1472</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Multiply_2522" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1472</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1472</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_2708" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16" offset="850352" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="StatefulPartitionedCall/model_4/batch_normalization_55/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_55/batchnorm/add_1:0">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/model_4/activation_55/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/activation_55/Relu:0">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="StatefulPartitionedCall/model_4/concatenate_8/concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/concatenate_8/concat:0">
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_2617" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32" offset="850416" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Multiply_2529" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_2709" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16" offset="852464" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="StatefulPartitionedCall/model_4/batch_normalization_56/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/batch_normalization_56/batchnorm/add_1:0">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="StatefulPartitionedCall/model_4/activation_56/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_4/activation_56/Relu:0">
					<dim>-1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Func/StatefulPartitionedCall/input/_10:0" type="Const" version="opset1">
			<data element_type="f32" shape="1000, 8" offset="852528" size="32000" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_10:0">
					<dim>1000</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_304" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="531024" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="105" name="StatefulPartitionedCall/model_4/embedding_attributes/embedding_lookup" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1000</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>300</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/model_4/embedding_attributes/embedding_lookup:0">
					<dim>-1</dim>
					<dim>300</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="StatefulPartitionedCall/model_4/attribute_conv1d_1/Conv1D/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>300</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/attribute_conv1d_1/Conv1D/ExpandDims:0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>300</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_307" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="StatefulPartitionedCall/model_4/attribute_conv1d_1/Conv1D__80" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>300</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/attribute_conv1d_1/Conv1D__80:0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="StatefulPartitionedCall/model_4/attribute_conv1d_1/Conv1D/ExpandDims_1:0" type="Const" version="opset1">
			<data element_type="f32" shape="16, 8, 1, 5" offset="884528" size="2560" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_4/attribute_conv1d_1/Conv1D/ExpandDims_1:0">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="StatefulPartitionedCall/model_4/attribute_conv1d_1/Conv1D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/attribute_conv1d_1/Conv1D:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>296</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="StatefulPartitionedCall/model_4/attribute_conv1d_1/Conv1D/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>296</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_4/attribute_conv1d_1/Conv1D/Squeeze:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>296</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="const_fold_opt__207" type="Const" version="opset1">
